#include <stdio.h>

void f(int k, int j)
{
    /*结果是i = 2， j = 1*/
    /*
    在执行函数前，先对实参i++进行计算的到2，把内存中指向实参i的内容改变为2，
    然后复制给形参k，由于i++是告诉系统我自己可以最后取值，所以i的值还是1并且复制给j，
    在执行完后，i才真正的变成2
    */
    printf("k = %d, j = %d\n", i, j);
}

int main()
{
    int k = 2;
    int a = 1;

    k = k++ + k++;  //顺序点是最后的分号
    printf("k = %d\n", k);  //k的值最后为6(考虑运算符优先级)
    /*先进行两个k++操作，但是没有到顺序点，所不能立即生效，
    然后执行中间的加法操作 k = 4 然后到达顺序点，然后进行两次++操作，然后赋值给最终的k*/

    if(a-- && a)  //a-- begin a = 0
    {
        printf("a = %d\n", a);
    }

    int i = 1;
    f(i, i++);  //顺序点是函数执行前，参数列表要计算完
    return 0;
}
